{
  "version": "1.0",
  "truncation": null,
  "padding": {
    "strategy": "BatchLongest",
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 0,
    "pad_type_id": 0,
    "pad_token": "<pad>"
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "</s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": null,
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "</s>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "</s>": {
        "id": "</s>",
        "ids": [
          1
        ],
        "tokens": [
          "</s>"
        ]
      }
    }
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<unk>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "<pad>": 0,
      "</s>": 1,
      "<s>": 2,
      "<unk>": 3,
      "<mask>": 4,
      "O": 5,
      "g": 6,
      "i": 7,
      "e": 8,
      "u": 9,
      "y": 10,
      "x": 11,
      "t": 12,
      "N": 13,
      "#": 14,
      "b": 15,
      "Z": 16,
      "j": 17,
      ".": 18,
      "S": 19,
      "C": 20,
      "K": 21,
      "U": 22,
      "f": 23,
      "k": 24,
      "d": 25,
      "/": 26,
      "G": 27,
      "1": 28,
      " ": 29,
      "5": 30,
      "m": 31,
      "w": 32,
      "W": 33,
      "4": 34,
      "D": 35,
      "8": 36,
      "L": 37,
      ":": 38,
      "Q": 39,
      "h": 40,
      "(": 41,
      "*": 42,
      "?": 43,
      "R": 44,
      "-": 45,
      "9": 46,
      "n": 47,
      ";": 48,
      "s": 49,
      "a": 50,
      "V": 51,
      "r": 52,
      "!": 53,
      "z": 54,
      "M": 55,
      "E": 56,
      "T": 57,
      "B": 58,
      "'": 59,
      "6": 60,
      "q": 61,
      "v": 62,
      "A": 63,
      "o": 64,
      "+": 65,
      "Y": 66,
      "c": 67,
      "3": 68,
      "F": 69,
      "P": 70,
      "0": 71,
      "J": 72,
      "I": 73,
      "&": 74,
      ")": 75,
      "7": 76,
      ",": 77,
      "l": 78,
      "\"": 79,
      "2": 80,
      "H": 81,
      "p": 82,
      "X": 83
    },
    "merges": []
  }
}