{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "BertNormalizer",
    "clean_text": true,
    "handle_chinese_chars": true,
    "strip_accents": null,
    "lowercase": true
  },
  "pre_tokenizer": {
    "type": "BertPreTokenizer"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "[CLS]": {
        "id": "[CLS]",
        "ids": [
          2
        ],
        "tokens": [
          "[CLS]"
        ]
      },
      "[SEP]": {
        "id": "[SEP]",
        "ids": [
          3
        ],
        "tokens": [
          "[SEP]"
        ]
      }
    }
  },
  "decoder": {
    "type": "WordPiece",
    "prefix": "##",
    "cleanup": true
  },
  "model": {
    "type": "WordPiece",
    "unk_token": "[UNK]",
    "continuing_subword_prefix": "##",
    "max_input_chars_per_word": 100,
    "vocab": {
      "[PAD]": 0,
      "[UNK]": 1,
      "[CLS]": 2,
      "[SEP]": 3,
      "[MASK]": 4,
      "!": 5,
      "\"": 6,
      "#": 7,
      "$": 8,
      "%": 9,
      "&": 10,
      "'": 11,
      "(": 12,
      ")": 13,
      "*": 14,
      "+": 15,
      ",": 16,
      "-": 17,
      ".": 18,
      "/": 19,
      "0": 20,
      "1": 21,
      "2": 22,
      "3": 23,
      "4": 24,
      "5": 25,
      "6": 26,
      "7": 27,
      "8": 28,
      "9": 29,
      ":": 30,
      ";": 31,
      "<": 32,
      "=": 33,
      ">": 34,
      "?": 35,
      "@": 36,
      "[": 37,
      "\\": 38,
      "]": 39,
      "^": 40,
      "_": 41,
      "`": 42,
      "a": 43,
      "b": 44,
      "c": 45,
      "d": 46,
      "e": 47,
      "f": 48,
      "g": 49,
      "h": 50,
      "i": 51,
      "j": 52,
      "k": 53,
      "l": 54,
      "m": 55,
      "n": 56,
      "o": 57,
      "p": 58,
      "q": 59,
      "r": 60,
      "s": 61,
      "t": 62,
      "u": 63,
      "v": 64,
      "w": 65,
      "x": 66,
      "y": 67,
      "z": 68,
      "{": 69,
      "|": 70,
      "}": 71,
      "~": 72,
      "·": 73,
      "##u": 74,
      "##n": 75,
      "##i": 76,
      "##t": 77,
      "##l": 78,
      "##a": 79,
      "##s": 80,
      "##c": 81,
      "##1": 82,
      "##3": 83,
      "##8": 84,
      "##2": 85,
      "##o": 86,
      "##d": 87,
      "##e": 88,
      "##r": 89,
      "##g": 90,
      "##4": 91,
      "##m": 92,
      "##x": 93,
      "##7": 94,
      "##0": 95,
      "##k": 96,
      "##5": 97,
      "##p": 98,
      "##9": 99,
      "##z": 100,
      "##h": 101,
      "##6": 102,
      "##w": 103,
      "##f": 104,
      "##b": 105,
      "##y": 106,
      "##v": 107,
      "##q": 108,
      "##j": 109,
      "##an": 110,
      "##al": 111,
      "00": 112,
      "##st": 113,
      "##00": 114,
      "##ot": 115,
      "##er": 116,
      "gst": 117,
      "##as": 118,
      "##ou": 119,
      "##otal": 120,
      "##in": 121,
      "total": 122,
      "rm": 123,
      "in": 124,
      "##ar": 125,
      "##ce": 126,
      "ta": 127,
      "##nt": 128,
      "no": 129,
      "##01": 130,
      "##ang": 131,
      "re": 132,
      "tax": 133,
      "##on": 134,
      "##le": 135,
      "##ice": 136,
      "##at": 137,
      "##or": 138,
      "##es": 139,
      "##ash": 140,
      "sr": 141,
      "cash": 142,
      "su": 143,
      "co": 144,
      "am": 145,
      "##el": 146,
      "##me": 147,
      "##ount": 148,
      "10": 149,
      "th": 150,
      "inv": 151,
      "ch": 152,
      "##nd": 153,
      "##cl": 154,
      "##ing": 155,
      "##oice": 156,
      "invoice": 157,
      "##ur": 158,
      "201": 159,
      "##ed": 160,
      "##ay": 161,
      "50": 162,
      "##ty": 163,
      "20": 164,
      "12": 165,
      "amount": 166,
      "##is": 167,
      "##oo": 168,
      "##alan": 169,
      "jalan": 170,
      "03": 171,
      "##it": 172,
      "##em": 173,
      "##ange": 174,
      "18": 175,
      "90": 176,
      "you": 177,
      "11": 178,
      "incl": 179,
      "pr": 180,
      "qty": 181,
      "##ble": 182,
      "##mm": 183,
      "##et": 184,
      "##03": 185,
      "##en": 186,
      "it": 187,
      "##ary": 188,
      "##ion": 189,
      "than": 190,
      "##ri": 191,
      "##able": 192,
      "bh": 193,
      "change": 194,
      "thank": 195,
      "bhd": 196,
      "##ate": 197,
      "sal": 198,
      "##am": 199,
      "##ol": 200,
      "##dn": 201,
      "summ": 202,
      "sdn": 203,
      "##ust": 204,
      "summary": 205,
      "item": 206,
      "##ound": 207,
      "##ve": 208,
      "##13": 209,
      "##re": 210,
      "ad": 211,
      "##il": 212,
      "ex": 213,
      "##ain": 214,
      "date": 215,
      "##06": 216,
      "##ase": 217,
      "sales": 218,
      "of": 219,
      "##ood": 220,
      "##02": 221,
      "sh": 222,
      "2018": 223,
      "##ak": 224,
      "15": 225,
      "##mp": 226,
      "##pt": 227,
      "##pp": 228,
      "adj": 229,
      "80": 230,
      "round": 231,
      "30": 232,
      "sel": 233,
      "##ch": 234,
      "60": 235,
      "##51": 236,
      "##04": 237,
      "tel": 238,
      "##angor": 239,
      "good": 240,
      "selangor": 241,
      "13": 242,
      "id": 243,
      "inclu": 244,
      "01": 245,
      "##ah": 246,
      "##li": 247,
      "ple": 248,
      "##55": 249,
      "please": 250,
      "##ment": 251,
      "##ia": 252,
      "ag": 253,
      "##ier": 254,
      "14": 255,
      "cashier": 256,
      "not": 257,
      "st": 258,
      "again": 259,
      "reg": 260,
      "40": 261,
      "come": 262,
      "##de": 263,
      "goods": 264,
      "are": 265,
      "al": 266,
      "amt": 267,
      "##0000": 268,
      "per": 269,
      "fa": 270,
      "dis": 271,
      "for": 272,
      "##11": 273,
      "##si": 274,
      "rounding": 275,
      "70": 276,
      "##lo": 277,
      "16": 278,
      "##88": 279,
      "##old": 280,
      "02": 281,
      "disc": 282,
      "17": 283,
      "##32": 284,
      "price": 285,
      "##sive": 286,
      "##17": 287,
      "inclusive": 288,
      "sub": 289,
      "23": 290,
      "##92": 291,
      "##12": 292,
      "##cei": 293,
      "recei": 294,
      "19": 295,
      "##ct": 296,
      "sold": 297,
      "2017": 298,
      "##aya": 299,
      "ret": 300,
      "ref": 301,
      "##19": 302,
      "des": 303,
      "##73": 304,
      "##ard": 305,
      "##urn": 306,
      "adjust": 307,
      "33": 308,
      "##ic": 309,
      "##ag": 310,
      "return": 311,
      "##18": 312,
      "supp": 313,
      "adjustment": 314,
      "to": 315,
      "##50": 316,
      "##000": 317,
      "the": 318,
      "##16": 319,
      "##ee": 320,
      "or": 321,
      "us": 322,
      "##and": 323,
      "##ai": 324,
      "25": 325,
      "jaya": 326,
      "##54": 327,
      "22": 328,
      "24": 329,
      "##33": 330,
      "desc": 331,
      "code": 332,
      "pro": 333,
      "##ong": 334,
      "##ith": 335,
      "excl": 336,
      "lot": 337,
      "##52": 338,
      "po": 339,
      "pay": 340,
      "returnable": 341,
      "28": 342,
      "ser": 343,
      "with": 344,
      "discount": 345,
      "receipt": 346,
      "04": 347,
      "ti": 348,
      "##man": 349,
      "##ook": 350,
      "21": 351,
      "##76": 352,
      "##per": 353,
      "##72": 354,
      "alam": 355,
      "cs": 356,
      "##99": 357,
      "set": 358,
      "te": 359,
      "##lies": 360,
      "##ation": 361,
      "supplies": 362,
      "com": 363,
      "##oh": 364,
      "##any": 365,
      "on": 366,
      "ve": 367,
      "##38": 368,
      "##un": 369,
      "be": 370,
      "wh": 371,
      "##ut": 372,
      "29": 373,
      "26": 374,
      "07": 375,
      "06": 376,
      "se": 377,
      "ku": 378,
      "my": 379,
      "##56": 380,
      "47": 381,
      "##001": 382,
      "refu": 383,
      "taman": 384,
      "##ript": 385,
      "##low": 386,
      "refund": 387,
      "05": 388,
      "##ir": 389,
      "##08": 390,
      "descript": 391,
      "description": 392,
      "##om": 393,
      "time": 394,
      "joh": 395,
      "johor": 396,
      "##ke": 397,
      "sho": 398,
      "72": 399,
      "##ud": 400,
      "002": 401,
      "fax": 402,
      "31": 403,
      "09": 404,
      "27": 405,
      "##94": 406,
      "##ant": 407,
      "78": 408,
      "##ump": 409,
      "001": 410,
      "##aw": 411,
      "face": 412,
      "##ill": 413,
      "mar": 414,
      "##53": 415,
      "##book": 416,
      "##ala": 417,
      "##int": 418,
      "mal": 419,
      "##09": 420,
      "facebook": 421,
      "bar": 422,
      "##57": 423,
      "kuala": 424,
      "lump": 425,
      "##oc": 426,
      "##62": 427,
      "lumpur": 428,
      "##ul": 429,
      "si": 430,
      "tr": 431,
      "42": 432,
      "##ss": 433,
      "##07": 434,
      "##ery": 435,
      "##58": 436,
      "zr": 437,
      "exch": 438,
      "count": 439,
      "##der": 440,
      "##ly": 441,
      "and": 442,
      "08": 443,
      "45": 444,
      "##sa": 445,
      "56": 446,
      "##pe": 447,
      "setia": 448,
      "##rs": 449,
      "100": 450,
      "32": 451,
      "35": 452,
      "pm": 453,
      "un": 454,
      "exclud": 455,
      "##64": 456,
      "mo": 457,
      "##du": 458,
      "##71": 459,
      "##05": 460,
      "##ind": 461,
      "##anyu": 462,
      "sanyu": 463,
      "##eri": 464,
      "exchange": 465,
      "sa": 466,
      "##93": 467,
      "##mas": 468,
      "##eras": 469,
      "1851": 470,
      "39": 471,
      "##oi": 472,
      "##ustri": 473,
      "serv": 474,
      "##ma": 475,
      "##wn": 476,
      "shah": 477,
      "36": 478,
      "955": 479,
      "##002": 480,
      "##inal": 481,
      "##ter": 482,
      "##os": 483,
      "##0001": 484,
      "produ": 485,
      "excluding": 486,
      "##ue": 487,
      "order": 488,
      "product": 489,
      "53": 490,
      "ae": 491,
      "0003": 492,
      "##emb": 493,
      "perind": 494,
      "##ustrian": 495,
      "perindustrian": 496,
      "bill": 497,
      "rest": 498,
      "cheras": 499,
      "##eng": 500,
      "permas": 501,
      "##andar": 502,
      "aeon": 503,
      "48": 504,
      "kee": 505,
      "mak": 506,
      "##70": 507,
      "##84": 508,
      "fr": 509,
      "gr": 510,
      "86": 511
    }
  }
}