{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 1,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "</s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": null,
  "post_processor": null,
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<unk>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "<blank>": 0,
      "<pad>": 1,
      "<unk>": 2,
      "<s>": 3,
      "</s>": 4,
      "<mask>": 5,
      "<": 6,
      "9": 7,
      "M": 8,
      "Z": 9,
      ":": 10,
      "/": 11,
      "7": 12,
      "G": 13,
      "Y": 14,
      "V": 15,
      "%": 16,
      "1": 17,
      "&": 18,
      "4": 19,
      "_": 20,
      "T": 21,
      "*": 22,
      "I": 23,
      "C": 24,
      "B": 25,
      ".": 26,
      "K": 27,
      "·": 28,
      "-": 29,
      ",": 30,
      "Q": 31,
      "+": 32,
      "D": 33,
      "{": 34,
      "[": 35,
      "R": 36,
      "#": 37,
      "X": 38,
      "F": 39,
      "W": 40,
      "!": 41,
      "O": 42,
      "8": 43,
      "U": 44,
      "5": 45,
      "2": 46,
      "l": 47,
      "@": 48,
      "S": 49,
      " ": 50,
      "N": 51,
      "$": 52,
      "0": 53,
      "6": 54,
      ";": 55,
      "r": 56,
      "~": 57,
      ")": 58,
      "}": 59,
      "(": 60,
      "L": 61,
      "?": 62,
      "A": 63,
      "^": 64,
      "'": 65,
      ">": 66,
      "|": 67,
      "J": 68,
      "H": 69,
      "`": 70,
      "\"": 71,
      "P": 72,
      "\\": 73,
      "3": 74,
      "E": 75,
      "]": 76,
      "=": 77
    },
    "merges": []
  }
}